#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_service.module.container_definition["django-app"].data.aws_region.current: Reading...
module.ecs_cluster.data.aws_partition.current: Reading...
module.ecs_service.module.container_definition["django-app"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/django-personal-site/django-app]
aws_cloudwatch_log_group.django-log-group: Refreshing state... [id=/ecs/django-app]
module.ecs_service.data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_stream.django-log-stream: Refreshing state... [id=django-app-log-stream]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e1d0243d02de04e0]
module.ecs_cluster.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.module.container_definition["django-app"].data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=1415633931]
data.aws_availability_zones.aws_azs: Reading...
module.ecs_service.data.aws_partition.current: Reading...
aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ecs_service.aws_iam_policy.task_exec[0]: Refreshing state... [id=arn:aws:iam::954050840447:policy/django-personal-site-20231020130010305600000003]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecs_service.aws_iam_role.task_exec[0]: Refreshing state... [id=django-personal-site-20231020130010303600000001]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=954050840447]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3252303218]
module.ecs_service.aws_iam_role.tasks[0]: Refreshing state... [id=django-personal-site-20231020130010304400000002]
aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
module.ecs_service.aws_iam_role_policy_attachment.task_exec[0]: Refreshing state... [id=django-personal-site-20231020130010303600000001-20231020130010604800000005]
aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
data.aws_availability_zones.aws_azs: Read complete after 1s [id=eu-west-1]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e39f2ae61401b1c4]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09db5785a6dfd071c]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08a301e7900ff17ef]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e8fc1e1647b7df17]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-083ae407345a775e5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-077f4e93189de9d4e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a2558af275291418]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac9304bc66da227f]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe]
module.alb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-032cfc42b7478e925]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f096da4f7714fcf7]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06f8c93e4a685e1ab]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a477dbbde07c0098]
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08068361a78700ab1]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[3]: Refreshing state... [id=sgrule-2473780471]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a92982e3e98f3ad6]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3522305327]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3552822451]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06f8c93e4a685e1ab1080289494]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[2]: Refreshing state... [id=sgrule-1143663398]
module.alb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-86115656]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0a2558af275291418]
module.alb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-441417626]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2708099d9838709]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e0b862f487d38fd]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:loadbalancer/app/django-elb/3d0916a3c7717f9e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d2d71fa8544ec8c]
module.ecs_service.aws_security_group.this[0]: Refreshing state... [id=sg-06555b36d0678f385]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f096da4f7714fcf71080289494]
module.ecs_service.aws_security_group_rule.this["alb_ingress_3000"]: Refreshing state... [id=sgrule-851394091]
module.ecs_service.aws_security_group_rule.this["egress_all"]: Refreshing state... [id=sgrule-2387903463]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:954050840447:listener/app/django-elb/3d0916a3c7717f9e/3713d42335b643a3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.django-log-group will be destroyed
  # (because aws_cloudwatch_log_group.django-log-group is not in configuration)
  - resource "aws_cloudwatch_log_group" "django-log-group" {
      - arn               = "arn:aws:logs:eu-west-1:954050840447:log-group:/ecs/django-app" -> null
      - id                = "/ecs/django-app" -> null
      - name              = "/ecs/django-app" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_cloudwatch_log_stream.django-log-stream will be destroyed
  # (because aws_cloudwatch_log_stream.django-log-stream is not in configuration)
  - resource "aws_cloudwatch_log_stream" "django-log-stream" {
      - arn            = "arn:aws:logs:eu-west-1:954050840447:log-group:/ecs/django-app:log-stream:django-app-log-stream" -> null
      - id             = "django-app-log-stream" -> null
      - log_group_name = "/ecs/django-app" -> null
      - name           = "django-app-log-stream" -> null
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/django-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "django-prod"
      + tags_all = (known after apply)

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "django-prod"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 50
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "FARGATE"
          + weight            = 50
        }
    }

  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "django-personal-site"
      + task_role_arn        = (known after apply)
    }

  # module.ecs_service.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs_service.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "django-personal-site"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all                           = {
          + "ManagedBy" = "Terraform"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "django-app"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:954050840447:targetgroup/django-ecs-tg/ea1528c3647317fe"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-06555b36d0678f385",
            ]
          + subnets          = [
              + "subnet-083ae407345a775e5",
              + "subnet-0a2558af275291418",
            ]
        }

      + timeouts {}
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command                = [
                      + "gunicorn",
                      + "-w",
                      + "3",
                      + "-b",
                      + ":8000",
                      + "django_project.wsgi:application",
                    ]
                  + cpu                    = 512
                  + environment            = []
                  + essential              = true
                  + image                  = "pcollinz/philward_io:latest"
                  + interactive            = false
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/django-personal-site/django-app"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory                 = 512
                  + mountPoints            = []
                  + name                   = "django-app"
                  + portMappings           = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + name          = "django-app"
                          + protocol      = "tcp"
                        },
                    ]
                  + privileged             = false
                  + pseudoTerminal         = false
                  + readonlyRootFilesystem = true
                  + startTimeout           = 30
                  + stopTimeout            = 120
                  + user                   = "0"
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::954050840447:role/django-personal-site-20231020130010303600000001"
      + family                   = "django-personal-site"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "ManagedBy" = "Terraform"
        }
      + tags_all                 = {
          + "ManagedBy" = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::954050840447:role/django-personal-site-20231020130010304400000002"

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

Plan: 8 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @phil-ward, Action: `pull_request`, Working Directory: ``, Workflow: `ci`*